print(1,3,5)
print('아무개씨', '안녕하세요')
print('-'*20)

# 구분자 + 는 문자열 일때는 연결하여 출력(띄어쓰기 안함)
print(1+3+5)
print('홍길동'+'아무개')

# +기호는 반드시 타입이 맞아야 한다
# print(1 + '홍길동') : 오류
print(str(1) + '홍길동')  # 자료형 변환하면 사용 가능

# 컴마(,)는 자료형과 상관없이 모두 가능
print(1, '홍길동')
print('-'*20)

# 서식 출력 %d(정수), %f(실수), %s(문자열)
print("정수 : %d, 실수 : %f, 문자열 : %s" %(5, 3.14, '홍길동'))

# 자리지정 %자리수d(정수), %자리수f(실수), %자리수s(문자열)
print("정수 : %3d, 실수 : %6.4f, 문자열 : %5s" %(5, 3.14, '홍길동'))

print('실수 소수점 2째 자리까지만 출력 : %.2f, %.2f, %.2f' %(12.1546, 172.4723, 3.38921834))
print('-'*20)

# sep 속성
# : 분리 문자 설정 - 기본적으로 분리문자 공백하나가 들어가 있다
print(5, 7.7, '더조은', True)  # 안넣으면 기본값 sep=' '
print(5, 7.7, '더조은', True, sep='/')
print(5, 7.7, '더조은', True, sep=' / ')
print(5, 7.7, '더조은', True, sep=',')
print(5, 7.7, '더조은', True, sep='')
print('-' * 30)

print('오늘은\n수요일\n공부하는 날')
print('오늘은\t수요일\t공부하는 날')
# end속성 : 마지막 문자 설정
print('Hello', end='\n')
print('python', end='')
print('더조은', end='\n')
print('python', end='\t')
print('강남')
print('-' * 30)

print('{}, {}, {}'.format(100, 'Hello', 3.14159))
print('{1}, {2}, {0}'.format(100, 'Hello', 3.14159))
print('이름 : {}, 나이 : {}, data = {}'.format('홍길동', 21, 382.934))
print('이름 : {1}, 나이 : {2}, data = {0}'.format(382.934, '홍길동', 21))

print(format(3.14159))
print(format(3.14159, '.2f'))
print('원주율 = ', format(3.14159))
print('원주율 = {}'.format(3.14159))
print('원주율 = ', format(3.14159, '.2f'))
print('금액 : ', format(10000, '7d'))
print('금액 : ', format(5000, '7d'))
print('금액 : ', format(483935000, '3,d'))
print('-' * 30)

# f-string
# 문자열을 만드는 따옴표(',") 앞에 알파벳 f(또는 대문자 F)를 붙여주고
# 문자열 내부에서 변수를 넣고 싶은 자리에 {변수명}을 적는다
print('두 수의 합은 ', 3+5, '입니다')
print('두 수의 합은 ' + str(3+5) + ' 입니다')
print(f'두 수의 합은 {3+5} 입니다')